# VerticalImageOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground..::..VerticalImageOffset Property
ViewDisplayBackground Class See Also
---
The distance between the bottom viewport boundary and the bottom edge of the background image.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double VerticalImageOffset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VerticalImageOffset As Double
	Get
```

Visual C++
---
```text
public:
property double VerticalImageOffset {
	double get ();
}
```

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace